// 2024/11/18 15:18:05 (c) Aleksandr Shevchenko e-mail : Sasha7b9@tut.by

/*

    Структура файла.

    +---------------+------------------------------------------+
    | Номера байтов | Содержимое                               |
    +---------------+------------------------------------------+
    | 0...3         | Номер версии                             |
    | 4...7         | Контрольная сумма следующих за этим байт |
    | 8...N         | Прошивка                                 |
    +---------------+------------------------------------------+
*/


int main()
{
    return 0;
}
